[
  {
    "Name":"REPUBLIC SQUARE",
    "Description_main":"Republic Square, at first named Revolution Square, is the largest square in Ljubljana. With its modernist design by architect Edvard Ravnikar, Trg republike square is heart of Slovenia’s statehood.",
    "Description_detail":"The square is a remarkable example of socialist modernist architecture. Plečnik’s pupil Edvard Ravnikar designed it in 1960 as the centre of modern Ljubljana, on a site previously occupied by the extensive gardens of the Ursuline convent.\n\t\tA group of architects led by Ravnikar worked on the square from 1962 until 1982. The vast central section of the square has hosted numerous historic events, including the declaration of Slovenia’s independence on 25 June 1991. The square is lined by a number of monuments from the period of socialist Yugoslavia. The largest of them is the Revolution monument by sculptor Drago Tršar, which was unveiled in 1975.\n\t\tThe Slovenian parliament building was built between 1954 and 1959 to plans by the architect Vinko Glanz as the seat of the People’s Assembly. A notable feature of the building is its two-storey main entrance, surrounded by sculptures symbolically depicting workers engaged in various occupations, the work of sculptors Zdenko Kalin and Karl Putrih.\n\t\tThe interior of the parliament building is adorned by paintings and murals by numerous Slovene artists. Notable among them is the mural by Slavko Pengov that extends right around the lobby of the Great Hall and depicts the history of the Slovene nation.",
    "Architect":"Edvard Ravnikar",
    "Year": "1974",
    "Adress": "Trg republike",
    "Image_name_main": "image_carousel_republic_square",
    "Image_names" : ["image_republic_square_1", "image_republic_square_2", "image_republic_square_3", "image_republic_square_4", "image_republic_square_5", "image_republic_square_6"],
    "Image_name_sketch": "sketch_tr",
    "Lat" : "46.050884",
    "Lon" : "14.500411"
  },
  {
    "Name":"ASTRA",
    "Description_main":"The Astra shopping and office centre is a continuation of an ambitious urban planner's vision of a business centre along the main city thoroughfare, beyond the railway line, that was initiated in the 1950s.",
    "Description_detail":"The Astra Center is following the new urban regulation which creates a more metropolitan northern city entrance road. The project includes two lower shopping premises and two high-rises that occupy a whole side of a city block with an emphasized corner.\n\t\tThe towers have glass facade, commercial part is surrounded by panels of artificial stone. Building facades are articulated with respect to the internal structure of space and structure, which was one of the design principles of the architect Sever. Towers construction is formed by corner walls, amongst which are positioned four offices. Towers have double glazed window what allows ventilation, shading and protection from noise. This was the first building in Slovenia that was designed with a double-layered glass facade and an interspace enabling ventilation.",
    "Architect":"Savin Sever",
    "Year": "1970",
    "Adress": "Dunajska cesta 47-53",
    "Image_name_main": "image_carousel_astra",
    "Image_names" : ["image_carousel_republic_square", "image_republic_square_1"],
    "Image_name_sketch": "sketch_astra",
    "Lat" : "46.065257",
    "Lon" : "14.508859"
  },
  {
    "Name":"BEŽIGRAD NEIGHBOURHOOD",
    "Description_main":"The Bežigrajska soseska 3 (BS 3) neighbourhood covers an area 800 metres long and 250 metres wide and is one of the largest neighbourhoods in Ljubljana. Its complex, hyper-urban structure was designed by Mitja Jernejec, with architectural design by Ilija Arnautović.",
    "Description_detail":"Like many other neighbourhoods in Ljubljana, the construction of BS 3 was never completed in full. Despite this fact, however, it boasts many interesting features that contribute to its special character. According to the initial design, there should have been two enormous apartment blocks constructed on its eastern border. Instead these were replaced with tower blocks with pointed caps at the top, which are the identifying feature of the neighbourhood today.\n\t\tTower blocks are positioned in two clusters along Vojkova Street, while the interior core of the neighbourhood evolves into long rows of low-rise apartment buildings with access roads running underneath. The friendly character of the neighbourhood is accentuated by generous outdoor spaces – green areas, parks, squares, alleys and footpaths. They are designed as green alleys separating apartments from each other, with playgrounds, rest areas and recreation islands lined up along them.",
    "Architect":"Ilija Arnautović",
    "Year": "1971",
    "Adress": "Reboljevaa, Maroltova, Trebinjska and Puhova Streets",
    "Image_name_main": "image_carousel_bezigrajska_soseska",
    "Image_names" : ["image_carousel_republic_square", "image_republic_square_1"],
    "Image_name_sketch": "sketch_bezigrajska",
    "Lat" : "46.081062",
    "Lon" : "14.519840"
  },
  {
    "Name":"CANKARJEV DOM",
    "Description_main":"The Cankarjev dom cultural and congress centre, is the largest Slovenian convention, congress and culture center.",
    "Description_detail":"The Cankarjev dom cultural and congress centre, Slovenia's largest cultural institution, was built between 1982 and 1983 to designs by the architect Edvard Ravnikar.\n\t\tIts numerous halls, connected by a large foyer on the upper floor and a smaller one on the lower floor, are used as venues for concerts, theatre performances, film screenings and conferences.\n\t\tThe Cankarjev dom was a subsequent addition to Ravnikar's original plans for the Trg republike square. In order to prevent the building from being too tall, most of the halls were built under the ground. The above-the-ground part consists of three wings, a taller one in the middle and two lower ones on the sides. The façade is covered in white stone and ornamented with decorative folds on the sides.\n\t\tThe monument standing in front of the building, shaped in the form of a multi-layer metal cube depicting the face of Ivan Cankar, the greatest Slovenian writer, was sculpted by Slavko Tihec.",
    "Architect":"Edvard Ravnikar",
    "Year": "1983",
    "Adress": "Prešernova cesta 10",
    "Image_name_main": "image_carousel_cankarjev",
    "Image_names" : ["image_carousel_republic_square", "image_republic_square_1"],
    "Image_name_sketch": "sketch_astra",
    "Lat" : "46.049866",
    "Lon" : "14.499219"
  },
  {
    "Name":"FERANT GARDEN",
    "Description_main":"The Ferant Garden business and residential complex was designed by Edvard Ravnikar as a cluster of housing units to complement the existing body of apartments in the city centre, and to lend the southern part of the city a more metropolitan character.",
    "Description_detail":"New buildings in conjunction with older houses along Rimska Street form a residential island with several commercial establishments on the ground floors.\n\t\tThe housing complex is situated on the site of an ancient Roman forum. Architect Edvard Ravnikar incorporated this into the design of individual buildings, while at the same time displaying the remains of the Roman Emona (the first incarnation of present day Ljubljana) in the Jakopič Gallery on Slovenska Street.\n\t\tApartments run through the building, facing both the street as well as the courtyard. The courtyard is designed as an open public park with garages hidden underneath. Belts of balconies and windows alternating on the façade together with a combination of brick and concrete lend the buildings a special character.\n\t\tThey are further brought together into a unified whole by certain architectural details, like the characteristic brick corner “stitches” and concrete flower boxes, which residents have planted with abundant greenery.",
    "Architect":"Edvard Ravnikar",
    "Year": "1975",
    "Adress": "Between Gregoričičeva, Rimska, Igriška and Slovenska Streets",
    "Image_name_main": "image_carousel_ferantovi_vrtovi",
    "Image_names" : ["image_carousel_republic_square", "image_republic_square_1"],
    "Image_name_sketch": "sketch_astra",
    "Lat" : "46.048124",
    "Lon" : "14.501300"
  },
  {
    "Name":"GOSPODARSKO RAZSTAVIŠČE",
    "Description_main":"The Exhibition and Convention Centre (Gospodarsko razstavišče) in Ljubljana is a venue for organising domestic and international fairs as well as other events.",
    "Description_detail":"The building complex stands in the Bežigrad District, between Vienna Street (Dunajska cesta, Vilhar Street (Vilharjeva cesta), and Robba Street (Robbova ulica), north of the Ljubljana railway station.\n\t\tIt is operated by the Ljubljana Exhibition and Convention Centre company. The basic mission of the company is the organization of various events where the exhibitors and visitors meet and cooperate creatively.\n\t\tThe center was designed by architects Ilija Arnautović, Milan Mihelič, Branko Simčič, and Marko Šlajmer in the 1950s and the 1960s. In 1954 the Communist Party of Yugoslavia decided that its 1955 7th Congress would take place in the new exhibition centre, and the construction was sped up accordingly.\n\t\tTo make room for the new exhibition center, many of the old structures were destroyed. It was built on top of the former Saint Christopher's Cemetery and two churches were removed for the construction: the old Saint Christopher's Church (a Baroque structure) and Saints Cyril and Methodius Church (designed by Jože Plečnik).",
    "Architect":"Ilija Arnautović, Boris Gaberščik, Milan Mihelič, Branko Simčič",
    "Year": "1959",
    "Adress": "Trg 7. kongresa ZKJ",
    "Image_name_main": "image_carousel_gospodarsko_raztavisce",
    "Image_names" : ["image_carousel_republic_square", "image_republic_square_1"],
    "Image_name_sketch": "sketch_astra",
    "Lat" : "46.061956",
    "Lon" : "14.508154"
  },
  {
    "Name":"THE CANARY",
    "Description_main":"Ljudska pravica office building, popularly known as Kanarček (The Canary) because of its yellow faćade, was built in 1961 to the plans of architect Edvard Ravnikar.",
    "Description_detail":"In terms of urban design this was a difficult building, as the new building had to be incorporated among the existing buildings of old Ljudska pravica, Plecnik's Peglezen and the former Financial Directorate, all of which originate from their respect ive eras and styles.\n\t\tThis environment is, at the same time, visually connected to the old part of Ljubljana and yet the site is outside the area of the old city core and outside the city gate. It could therefore represent a natural perimeter of the old urban organism, particularly with the greenery provided by the old plane trees next to the new building. The view from the new building towards the cathedral is richer due to the greater architectural mass of the Pravica building, while the area of the Baroque Ljubljana is closer to the centre as a result of the buzz that the new building provides.\n\t\tPart of the task was to locate an industrial building within the city. The print works are connected to intense intellectual work, which normally takes place in the city centre; on the other hand, however, they require the proximity of the printing process. This project required also extremely cost effective construction - the use of contemporary materials in their crude, unprocessed state: poured concrete, glass, plastic and aluminium. All this had to be used with great care for the articulation of the whole, of the details, the precision of execution and finally for the use of colour, which in the case of this building raises so many objections.\n\t\tHowever, the very yellow used is traditionally a colour used in graphics, while on the other hand it provides the only colour emphasis among the surrounding grey buildings and intense greenery. Thus an intended unity of the perceived colour is achieved in this environment.",
    "Architect":"Edvard Ravnikar",
    "Year": "1961",
    "Adress": "Kopitarjeva ulica 2",
    "Image_name_main": "image_carousel_kanarcek",
    "Image_names" : ["image_carousel_republic_square", "image_republic_square_1"],
    "Image_name_sketch": "sketch_astra",
    "Lat" : "46.051224",
    "Lon" : "14.510872"
  },
  {
    "Name":"KOSEZE NEIGHBOURHOOD",
    "Description_main":"The Koseze residential neighbourhood is a scaledback version of the winning development proposal for the area of Šišenska soseska neighbourhoods 9 and 10. Its terraced apartment buildings are a combination of residential apartment blocks and single-family houses.",
    "Description_detail":"Built closely together in a dense configuration, all of the apartments in the upper storeys feature large outside terraces while those on the ground level have gardens.\n\t\tModelled on a German example, the Koseze apartment blocks were the first terraced blocks in Ljubljana and were considered a quality typological innovation at the time of their construction. They are designed as “hills” and grow narrower as they gradually increase in height, creating a more human-friendly scale, while at the same time the property below is put to good use.\n\t\tEntrances to apartment buildings are accessible on footpaths lined with greenery and running between parallel rows of identical blocks. Traffic is restricted to the perimeter of the neighbourhood, with parking spaces in underground garages. Thus, the neighbourhood stays rich with greenery and remains traffic-free.",
    "Architect":"Viktor Pust",
    "Year": "1968",
    "Adress": "Ul. Bratov Učakar Street",
    "Image_name_main": "image_carousel_koseze",
    "Image_names" : ["image_carousel_republic_square", "image_republic_square_1"],
    "Image_name_sketch": "sketch_astra",
    "Lat" : "46.072100",
    "Lon" : "14.472844"
  },
  {
    "Name":"NAMA",
    "Description_main":"Nama, or NAMA, is the acronym for Narodni magazin 'national store'. This was a chain of department stores in the former SFRY (Yugoslavia) and the first Slovenian department store.",
    "Description_detail":"The seven-storey original building of the NAMA store in Ljubljana, originally known as \"Service Hall\" (Dom službe), was completed in 1939 upon plans by the architect Franjo Lušičić. It was built in the modern style by the construction company owned by Josip Dedek.\n\t\tIn 1965, a new building, work by the architects Bogdan Fink and Miloš Lapajne, was added to it at its southern side. In 2002, at the restoration, its facade was redesigned in glass, despite the opposition of the original authors.",
    "Architect":"Bogdan Fink, Miloš Lapajne",
    "Year": "1965",
    "Adress": "Tomšičeva ulica 2",
    "Image_name_main": "image_carousel_nama",
    "Image_names" : ["image_carousel_republic_square", "image_republic_square_1"],
    "Image_name_sketch": "sketch_astra",
    "Lat" : "46.052128",
    "Lon" : "14.503112"
  },
  {
    "Name":"PETROL STATION",
    "Description_main":"Between 1950 and 1970, four unique petrol stations were created across the city of Ljubljana. These petrol stations were of a pioneering design that combined the material sciences and engineering innovations. ",
    "Description_detail":"Perhaps the most ambitious addition to the \"Petrol\" brand series of service stations in Ljubljana was a creation by Slovene architect Edvard Ravnikar, who is often considered the most famous and influential of all Yugoslav-era architects in Slovenia.\n\t\tBuilt literally right across the street from Mihelič's station at Tivolska 46 that was constructed two years earlier, Ravnikar's structure consists of three identical umbrella canopies created of a thin concrete facade. All three are interconnected, stretching out over nearly 60 meters, and are designed in a swooping space-age fashion that gives them an indelibly sleek impression of speed and motion.\n\t\tThis complex continues to operate into the present day as a \"Petrol\" brand service station, with the structure appearing almost exactly as it did when it was first unveiled in 1970. The architecture of this structure has become so iconic in Ljubljana that one architecture firm in the city named \"Multiplan\" has proposed a new service station concept to \"Petrol\" which is directly inspired by Ravnikar's design.",
    "Architect":"Edvard Ravnikar",
    "Year": "1969",
    "Adress": "Tivolska 43",
    "Image_name_main": "image_carousel_petrol",
    "Image_names" : ["image_carousel_republic_square", "image_republic_square_1"],
    "Image_name_sketch": "sketch_astra",
    "Lat" : "46.057924",
    "Lon" : " 14.504018"
  },
  {
    "Name":"SAVSKO NEIGHBOURHOOD",
    "Description_main":"The Savsko naselje neighbourhood is the first postwar housing area to include all the elements of a residential neighbourhood.",
    "Description_detail":"The apartment buildings of Savsko naselje were built by different contractors, including the Yugoslav Army, the Housing Construction Institute, and various construction companies.\n\t\tEven before the construction layout plan was completed in 1958, single-storey houses with brick woodsheds reminiscent of pre-war workers’ colonies were built there. They were placed on a street grid designed before World War II by Jože Plečnik in his regulatory plan for the Svetokriški okraj district. A neighbourhood supplies centre was also built. The period after 1958 saw the construction of long, five-storey apartment blocks that were sited along a NE-SW axis in order for the apartments to better take advantage of daylight. With the construction of 14-storey apartment buildings along Linhartova Street at the beginning of the 1960s, the neighbourhood’s boundary was established.\n\t\tAt the end of the 1960s, the residential area spread westward, where a new part of the area with apartment buildings, an elementary school and a day care centre was built. Today, Savsko naselje is considered one of the greenest parts of the city and is popular for its proximity to central Ljubljana.",
    "Architect":"Ilija Arnautović, Milan Mihelič, Dušan Bohinec",
    "Year": "1961",
    "Adress": "Between Linhartova, Savska, Topniška and Šmartinska Streets",
    "Image_name_main": "image_carousel_savsko_naselje",
    "Image_names" : ["image_carousel_republic_square", "image_republic_square_1"],
    "Image_name_sketch": "sketch_astra",
    "Lat" : "46.065124",
    "Lon" : "14.520564"
  },
  {
    "Name":"ŠIŠENSKA SOSESKA 6",
    "Description_main":"The Šišenska soseska 6 (ŠS 6) neighbourhood is one of the first comprehensive neighbourhoods to be built according to the 1965 General Urban Plan (GUP) of Ljubljana.",
    "Description_detail":"The Šišenska soseska 6 was built to provide housing for 10,000 people and carefully designed as a set of several smaller neighbourhoods.\n\t\tUrban planners intended the area along the major traffic artery entering the city to be more densely built, with the density easing towards the interior of the neighbourhood.\n\t\tThe centre of the neighbourhood, with its high-rise apartment buildings and tower blocks was therefore placed along the Celovška Street, while lower residential buildings were situated closer to the interior of the area. Apartment buildings are placed in dynamic lines, bays and horseshoe shapes, with abundant park greenery, children’s playgrounds and gardens in between; car traffic is limited to only a few bordering streets.\n\t\tAt the green heart of the neighbourhood are an elementary school, a day care centre and a gym. Pedestrian walkways were carefully planned so that no distance from home to school would be more than 600 metres. With its formal, fan-shaped design and typical traditional town elements like a street, a square and a closed urban block, the ŠS 6 neighbourhoods represented one of the first deviations from functional urbanism.",
    "Architect":"Ilija Arnautović, Aleksander Peršin",
    "Year": "1964",
    "Adress": "Trg komandanta Staneta Square",
    "Image_name_main": "image_carousel_sisenksa_soseska_6",
    "Image_names" : ["image_carousel_republic_square"],
    "Image_name_sketch": "sketch_astra",
    "Lat" : "46.071091",
    "Lon" : "14.480415"
  }
]